app/controllers/boards_controller.rb

  def index
    @board = Board.create
    99.times do
      @board.maze << '.'
      @board.save
---
INSERT INTO "boards" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-05-08 05:24:00.976048"], ["updated_at", "2016-05-08 05:24:00.976048"]]
UPDATE "boards" SET "maze" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["maze", ".."], ["updated_at", "2016-05-08 05:28:40.985952"], ["id", 8]]

  def update
    @board = Board.find(params[:id])
    type = case params[:type]
           when 'path' then '.'
           when 'maze-walker' then 'o'
           when 'finish-line' then '*'
           when 'wall' then '#'
           end
    @board.maze[params[:number].to_i] = type
    @board.save
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 36]]
UPDATE "boards" SET "maze" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["maze", "................................#..................................................................."], ["updated_at", "2016-05-08 06:28:26.119753"], ["id", 46]]